Public Attributes | List of all members
API_CalcRulesPrefs Struct Reference
Project Settings
The representation of the Calculation Rules on the Preferences / Calculation Units Rules tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
GS::Array< API_ConditionalElementRule >  | elementRules
Conditional calculation rules for elements.
GS::HashSet< API_AttributeIndex >  | wallInsulationFills
Wall insulation fill indices.
GS::HashSet< API_AttributeIndex >  | wallAirFills
Wall air fill indices.
GS::HashSet< API_AttributeIndex >  | roofInsulationFills
Roof insulation fill indices.
GS::HashSet< API_AttributeIndex >  | shellInsulationFills
Shell insulation fill indexes.
Detailed Description
The representation of the Calculation Rules on the Preferences / Calculation Units Rules tab page.
Since
Archicad 25
Remarks
The ACAPI_ProjectSetting_GetPreferences function uses this structure to get the settings of the Calculation Rules on the Preferences / Calculation Units Rules preferences page. From API 25 BNZeroMemory, BNClear, or memset should not be used to initialize an object of this structure.
Member Data Documentation
◆ elementRules
 API_CalcRulesPrefs::elementRules
Conditional calculation rules for elements.
◆ roofInsulationFills
 API_CalcRulesPrefs::roofInsulationFills
Roof insulation fill indices.
◆ shellInsulationFills
 API_CalcRulesPrefs::shellInsulationFills
Shell insulation fill indexes.
◆ wallAirFills
 API_CalcRulesPrefs::wallAirFills
Wall air fill indices.
◆ wallInsulationFills
 API_CalcRulesPrefs::wallInsulationFills
Wall insulation fill indices.